# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\Mac\Data\VScode\GIT\MacPro_KickStart\PSoC4200L.cydsn\PSoC4200L.cyprj
# Date: Sun, 07 May 2023 19:45:17 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {SPIS_HOST_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {SPIM_EE_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list [get_pins {ClockBlock/udb_div_3}]]


# Component constraints for \\Mac\Data\VScode\GIT\MacPro_KickStart\PSoC4200L.cydsn\TopDesign\TopDesign.cysch
# Project: \\Mac\Data\VScode\GIT\MacPro_KickStart\PSoC4200L.cydsn\PSoC4200L.cyprj
# Date: Sun, 07 May 2023 19:45:05 GMT
